Tekla Open API Reference for Tekla Structures 2025
Plugin Class
 The Plugin class represents a drawing plug-in.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.Plugin
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Plugin : DrawingObject
<SerializableAttribute>
Public NotInheritable Class Plugin
	Inherits DrawingObject
The Plugin type exposes the following members.
Constructors
Name | Description
Plugin
 Creates a new plug-in instance.
Top
Properties
Name | Description
Attributes
 Gets or sets the attributes of the current object. Only attributes of the same type as the object are allowed.
 (Inherited from DrawingObject.)
Name
 Gets the name of the plug-in.
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Top
Methods
Name | Description
ApplyStandardValues
 Applies the values of the specified file as the default values for the dialog belonging to this plug-in. This will affect each Insert call of the plug-ins with the same name.
Delete
 Deletes the plug-in from the current drawing database.
 (Overrides DatabaseObject.Delete().)
GetDoubleAttribute
 Gets the value of the specified double attribute of the plug-in.
GetDoubleUserProperties(Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetDoubleUserProperties(List<String>, Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetDrawing
 Gets the drawing where the drawing object is.
 (Inherited from DrawingObject.)
GetIntAttribute
 Gets the value of the specified int attribute of the plug-in.
GetIntegerUserProperties(Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetIntegerUserProperties(List<String>, Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetRelatedObjects()
 Gets the related objects of the current object.
 (Inherited from DrawingObject.)
GetRelatedObjects(Type[])
 Gets the related objects of the current object that are of certain types.
 (Inherited from DrawingObject.)
GetStringAttribute
 Gets the value of the specified string attribute of the plug-in.
GetStringUserProperties(Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetStringUserProperties(List<String>, Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetUserProperty(String, Double)
 Gets a double property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetUserProperty(String, Int32)
 Gets an integer property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetUserProperty(String, String)
 Gets a string property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetView
 Gets the view where the drawing object is.
 (Inherited from DrawingObject.)
Insert
 Inserts the plug-in into the current drawing database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
IsSameDatabaseObject
 Returns true if the current object and the given object are referencing the same database object.
 (Inherited from DatabaseObject.)
LoadStandardValues
 Sets the values from the specified file to this plug-in.
Modify
 Modifies the plug-in in the current drawing database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the plug-in from the current drawing database.
 (Overrides DatabaseObject.Select().)
SetAttribute(String, Double)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
SetAttribute(String, Int32)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
SetAttribute(String, String)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
SetPickerInput
 Defines the sequence of inputs to use in place of interactive picks when the plug-in is inserted to a drawing.
SetUserProperty(String, Double)
 Sets a double property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
SetUserProperty(String, Int32)
 Sets an integer property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
SetUserProperty(String, String)
 Sets a string property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
ToString
 Changes the string presentation of the drawing object.
 (Inherited from DrawingObject.)
TryGetAttribute(String, Double)
 Gets the value of the specified double attribute of the plug-in.
TryGetAttribute(String, Int32)
 Gets the value of the specified int attribute of the plug-in.
TryGetAttribute(String, String)
 Gets the value of the specified string attribute of the plug-in.
TrySetAttribute(String, Double)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
TrySetAttribute(String, Int32)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
TrySetAttribute(String, String)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
Top
Examples
 The following example demonstrates how to insert a plug-in into a view. The plug-in used in this example is the Center of gravity dimensions plug-in (COGDimensioning).
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
    public void Example1()
    {
        DrawingHandler MyDrawingHandler = new DrawingHandler();
        DrawingObjectEnumerator allViews = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
        allViews.MoveNext();
        ViewBase curView = allViews.Current as ViewBase;
        Plugin myPlugin = new Plugin(curView, "COGDimensioning");
        PluginPickerInput newPluginInput = new PluginPickerInput();
        newPluginInput.Add(new PickerInputPoint(curView, new Point(100, 200)));
        newPluginInput.Add(new PickerInputPoint(curView, new Point(300, 400)));
        myPlugin.SetPickerInput(newPluginInput);
        myPlugin.Insert(); // Inserts the plug-in, the plug-in's DefineInput method's UI.Picker calls will use the given data above.
        // After the Insert returns the Plugin is inserted into the drawing view.
        // Alternatively, if there are some errors during the insertion of the plug-in,
        // exceptions may be thrown or the return value of Insert will be false.
    }
}
See Also
Reference
Tekla.Structures.Drawing Namespace